; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/floortile/domain.pddl
;; updates:
;;   - :action-costs removed
;;   - movements updated to move_* to avoid repeating action and predicate names, e.g., up pred. with up act.
;;   - all action names use underscore

(define (domain floortile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (down ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (left ?x - tile ?y - tile)
    (clear ?x - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
    (free-color ?r - robot))

(:action change_color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)

(:action paint_up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

(:action paint_down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

; Robot movements
(:action move_up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

)

; problem
;; base case
;;
(define (problem floortile-13)
 (:domain floortile)
 (:objects
    tile_0_1
    tile_0_2
    tile_1_1
    tile_1_2
    tile_2_1
    tile_2_2 - tile
    robot1 robot2 - robot
    white black - color
)
 (:init
    (robot-at robot1 tile_0_1)
    (robot-at robot2 tile_1_2)
    (robot-has robot1 black)
    (robot-has robot2 black)
    (available-color white)
    (available-color black)
    (clear tile_0_2)
    (clear tile_1_1)
    (clear tile_2_1)
    (clear tile_2_2)
    (up tile_1_1 tile_0_1 )
    (up tile_1_2 tile_0_2 )
    (up tile_2_1 tile_1_1 )
    (up tile_2_2 tile_1_2 )
    (down tile_0_1 tile_1_1 )
    (down tile_0_2 tile_1_2 )
    (down tile_1_1 tile_2_1 )
    (down tile_1_2 tile_2_2 )
    (left tile_0_1 tile_0_2 )
    (left tile_1_1 tile_1_2 )
    (left tile_2_1 tile_2_2 )
    (right tile_0_2 tile_0_1 )
    (right tile_1_2 tile_1_1 )
    (right tile_2_2 tile_2_1 ))
 (:goal  (and
    (painted tile_1_1 white)
    (painted tile_1_2 black)
    (painted tile_2_1 black)
    (painted tile_2_2 white))))

; plan
1. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 0 of 4
2. (paint_up robot2 tile_2_2 tile_1_2 white)
   deleted: (clear tile_2_2)
   added: (painted tile_2_2 white)
   goals met: 1 of 4
3. (change_color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 1 of 4
4. (move_left robot2 tile_1_2 tile_1_1)
   deleted: (robot-at robot2 tile_1_2) (clear tile_1_1)
   added: (robot-at robot2 tile_1_1) (clear tile_1_2)
   goals met: 1 of 4
5. (paint_up robot2 tile_2_1 tile_1_1 black)
   deleted: (clear tile_2_1)
   added: (painted tile_2_1 black)
   goals met: 2 of 4
6. (move_right robot1 tile_0_1 tile_0_2)
   deleted: (robot-at robot1 tile_0_1) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_0_1)
   goals met: 2 of 4
7. (paint_up robot1 tile_1_2 tile_0_2 black)
   deleted: (clear tile_1_2)
   added: (painted tile_1_2 black)
   goals met: 3 of 4
8. (move_down robot2 tile_1_1 tile_0_1)
   deleted: (robot-at robot2 tile_1_1) (clear tile_0_1)
   added: (robot-at robot2 tile_0_1) (clear tile_1_1)
   goals met: 3 of 4
9. (change_color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 3 of 4
10. (paint_up robot2 tile_1_1 tile_0_1 white)
   deleted: (clear tile_1_1)
   added: (painted tile_1_1 white)
   goals met: 4 of 4
